### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.kubernetes_addons.module.argocd[0].helm_release.argocd_application["addons"] will be created
+   resource "helm_release" "argocd_application" {
+       atomic                     = false
+       chart                      = ".terraform/modules/kubernetes_addons/modules/kubernetes-addons/argocd/argocd-application/helm"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "addons"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                "ignoreDifferences": []
            EOT,
        ]
+       verify                     = false
+       version                    = "0.1.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "destination.server"
+           type  = "string"
+           value = "https://kubernetes.default.svc"
        }
+       set {
+           name  = "name"
+           type  = "string"
+           value = "addons"
        }
+       set {
+           name  = "project"
+           type  = "string"
+           value = "default"
        }
+       set {
+           name  = "source.helm.releaseName"
+           type  = "string"
+           value = "addons"
        }
+       set {
+           name  = "source.helm.values"
+           type  = "auto"
+           value = <<-EOT
                "account": "484752921218"
                "clusterName": "jingood2-dev-eks"
                "region": "us-east-1"
                "repoUrl": "https://github.com/aws-samples/eks-blueprints-add-ons.git"
            EOT
        }
+       set {
+           name  = "source.path"
+           type  = "string"
+           value = "chart"
        }
+       set {
+           name  = "source.repoUrl"
+           type  = "string"
+           value = "https://github.com/aws-samples/eks-blueprints-add-ons.git"
        }
+       set {
+           name  = "source.targetRevision"
+           type  = "string"
+           value = "HEAD"
        }
    }

  # module.kubernetes_addons.module.argocd[0].kubernetes_namespace_v1.this[0] will be created
+   resource "kubernetes_namespace_v1" "this" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.kubernetes_addons.module.argocd[0].module.helm_addon.helm_release.addon[0] will be created
+   resource "helm_release" "addon" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       description                = "The ArgoCD Helm Chart deployment configuration"
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argo-cd"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 1200
+       values                     = [
+           <<-EOT
                redis-ha:
                  enabled: true
                
                controller:
                  enableStatefulSet: true
                
                server:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                
                repoServer:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                
                configs:
                  cm:
                    #use annotation for tracking but keep labels for compatibility with other tools
                    application.resourceTrackingMethod: annotation+label
            EOT,
        ]
+       verify                     = false
+       version                    = "5.13.8"
+       wait                       = false
+       wait_for_jobs              = false

+       postrender {}

+       set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>